---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawRoof
source: html/8cafbc5c-e056-a5f2-1e2b-f1e4807f31a8.htm
---
# Autodesk.Revit.DB.BuiltInFailures.CreationFailures.CannotDrawRoof Property

Can't make roof.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotDrawRoof { get; }
```